In [2]:
import pandas as pd

df1=pd.read_excel("C:\\Users\\29265\\Desktop\\data.xlsx",sheetname='Sheet4')
df2=pd.read_excel("C:\\Users\\29265\\Desktop\\data.xlsx",sheetname='Sheet5')

In [3]:
df1

    str  sales  units  txns
0  str1     20      2  2000
1  str2     30      1  2000
2  str3     20      1  2000
3  str4     60      4  3000
4  str5     20      1  4000
5  str7     40      1  2000

In [4]:
df2

    str  sales  units  txns
0  str8     20      2  2000
1  str9     30      1  2000
2  str3     20      1  2000
3  str4     60      4  3000
4  str5     20      1  4000
5  str7     40      1  2000

In [6]:
pd.merge(df1,df2,on='str',indicator=True)

    str  sales_x  units_x  txns_x  sales_y  units_y  txns_y _merge
0  str3       20        1    2000       20        1    2000   both
1  str4       60        4    3000       60        4    3000   both
2  str5       20        1    4000       20        1    4000   both
3  str7       40        1    2000       40        1    2000   both

In [7]:
pd.merge(df1,df2,on='str',how='inner',indicator=True)

    str  sales_x  units_x  txns_x  sales_y  units_y  txns_y _merge
0  str3       20        1    2000       20        1    2000   both
1  str4       60        4    3000       60        4    3000   both
2  str5       20        1    4000       20        1    4000   both
3  str7       40        1    2000       40        1    2000   both

In [8]:
pd.merge(df1,df2,on='str',how='outer',indicator=True)

    str  sales_x  units_x  txns_x  sales_y  units_y  txns_y      _merge
0  str1     20.0      2.0  2000.0      NaN      NaN     NaN   left_only
1  str2     30.0      1.0  2000.0      NaN      NaN     NaN   left_only
2  str3     20.0      1.0  2000.0     20.0      1.0  2000.0        both
3  str4     60.0      4.0  3000.0     60.0      4.0  3000.0        both
4  str5     20.0      1.0  4000.0     20.0      1.0  4000.0        both
5  str7     40.0      1.0  2000.0     40.0      1.0  2000.0        both
6  str8      NaN      NaN     NaN     20.0      2.0  2000.0  right_only
7  str9      NaN      NaN     NaN     30.0      1.0  2000.0  right_only

In [9]:
pd.merge(df1,df2,on='str',how='right',indicator=True)

    str  sales_x  units_x  txns_x  sales_y  units_y  txns_y      _merge
0  str3     20.0      1.0  2000.0       20        1    2000        both
1  str4     60.0      4.0  3000.0       60        4    3000        both
2  str5     20.0      1.0  4000.0       20        1    4000        both
3  str7     40.0      1.0  2000.0       40        1    2000        both
4  str8      NaN      NaN     NaN       20        2    2000  right_only
5  str9      NaN      NaN     NaN       30        1    2000  right_only

In [11]:
a=pd.merge(df1,df2,on='str',how='left',indicator=True)

In [12]:
a[a['_merge']=='left_only']

    str  sales_x  units_x  txns_x  sales_y  units_y  txns_y     _merge
0  str1       20        2    2000      NaN      NaN     NaN  left_only
1  str2       30        1    2000      NaN      NaN     NaN  left_only

In [13]:
df1.iloc[0:3,0]

'str1'